AT_Demo/API/Result9/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_619fbb6f-9862-40b8-a36d-0189cba2a017.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;Body&gt;
    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;FlightOrder&gt;
        &lt;Class&gt;First&lt;/Class&gt;
        &lt;CustomerName&gt;MD S IMRAN&lt;/CustomerName&gt;
        &lt;DepartureDate&gt;2024-12-21T00:00:00&lt;/DepartureDate&gt;
        &lt;FlightNumber&gt;20279&lt;/FlightNumber&gt;
        &lt;NumberOfTickets&gt;3&lt;/NumberOfTickets&gt;
      &lt;/FlightOrder&gt;
    &lt;/CreateFlightOrder&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">HPFlights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">CreateFlightOrder</Operation><Address name="Address">http://localhost:24240/HPFlights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IHPFlights_Service/CreateFlightOrder</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_8a4c1645-95a4-44da-b9bc-7a987d79c1ab.xml">&lt;Envelope xmlns="htt ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IHPFlights_Service/CreateFlightOrder
Content-Type:	text/xml; charset=utf-8
Host:	localhost:24240
Content-Length:	408
Expect:	100-continue
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	335
Content-Type:	text/xml; charset=utf-8
Date:	Thu, 19 Dec 2024 23:27:59 GMT
Server:	Microsoft-HTTPAPI/1.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;OrderNumber&gt;33&lt;/OrderNumber&gt;&lt;TotalPrice&gt;336&lt;/TotalPrice&gt;&lt;/CreateFlightOrderResult&gt;&lt;/CreateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_3ae9d63a-b113-4143-8e62-c2bde0a631c6.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;OrderNumber&gt;33&lt;/OrderNumber&gt;
        &lt;TotalPrice&gt;336&lt;/TotalPrice&gt;
      &lt;/CreateFlightOrderResult&gt;
    &lt;/CreateFlightOrderResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'CreateFlightOrder'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>